# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv8s object detection model with AFPN neck fusion and SimAM attention in the backbone

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 3, C2f, [128, True]]         # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 6, C2f, [256, True]]         # 4
  - [-1, 1, SimAM, []]                # 5
  - [-1, 1, Conv, [512, 3, 2]]        # 6-P4/16
  - [-1, 6, C2f, [512, True]]         # 7
  - [-1, 1, SimAM, []]                # 8
  - [-1, 1, Conv, [1024, 3, 2]]       # 9-P5/32
  - [-1, 3, C2f, [1024, True]]        # 10
  - [-1, 1, SimAM, []]                # 11
  - [-1, 1, SPPF, [1024, 5]]          # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, AFPN, [512]]         # 14 fuse backbone P4 after SimAM
  - [-1, 3, C2f, [512]]               # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 5], 1, AFPN, [256]]         # 17 fuse backbone P3 after SimAM
  - [-1, 3, C2f, [256]]               # 18 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 15], 1, AFPN, [512]]        # 20 fuse head P4
  - [-1, 3, C2f, [512]]               # 21 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 12], 1, AFPN, [1024]]       # 23 fuse head P5
  - [-1, 3, C2f, [1024]]              # 24 (P5/32-large)

  - [[18, 21, 24], 1, Detect, [nc]]   # 25 Detect(P3, P4, P5)
